export const qnaList = [
    {
        q: '我经常从何处获得新的想法?',
        a: [
            { text: '别人', value: 'E' },
            { text: '我自己',value: 'I' }
        ]
    },
    {
        q: '当晚上参加一个社交聚会时，我更倾向于：',
        a: [
            { text: '一旦决定参加，也许会是最晚离开的那一个', value: 'E' },
            { text: '在夜晚开始的时候，我就疲倦了并且想回家', value: 'I' },
        ]
    },
    {
        q: '下列哪一项听起来更有吸引力？',
        a: [
            { text: '和朋友一起外出参加各类社交活动', value: 'E' },
            { text: '和朋友一起待在家里看电影并享用我最爱的食物', value: 'I' },
        ]
    },
    {
        q: '在和他人相处中，我是：',
        a: [
            { text: '整体来说蛮健谈的', value: 'E' },
            { text: '较安静并保留，直到我觉得舒服', value: 'I' },
        ]
    },
    {
        q: '我更倾向通过哪种方式找到工作：',
        a: [
            { text: '通过朋友介绍', value: 'E' },
            { text: '通过网络APP自己搜索', value: 'I' },
        ]
    },
    {
        q: '我倾向拥有：',
        a: [
            { text: '很多认识的人和很亲密的朋友', value: 'E' },
            { text: '一些很亲密的朋友和一些认识的人', value: 'I' },
        ]
    },
    {
        q: '过往工作中，我的同事们评价我：',
        a: [
            { text: '坦率开朗', value: 'E' },
            { text: '沉静矜持', value: 'I' },
        ]
    },
    {
        q: '我倾向通过以下方式收集信息：',
        a: [
            { text: '有可能发生之事的想象和期望', value: 'N' },
            { text: '目前状况实际认知', value: 'S' },
        ]
    },
    {
        q: '我倾向相信：',
        a: [
            { text: '直觉', value: 'N' },
            { text: '直接的观察和现成的经验', value: 'S' },
        ]
    },
    {
        q: '我在工作中更倾向：',
        a: [
            { text: '永远追求进步的空间', value: 'N' },
            { text: '若没有太差，可继续平稳发展', value: 'S' },
        ]
    },
    {
        q: '与他人沟通交流中，我更倾向聊：',
        a: [
            { text: '未来，关于改进或发明事物，和生活的种种可能性', value: 'N' },
            { text: '实际的，具体的，关于「此时此地」的事物', value: 'S' },
        ]
    },
    {
        q: '我是这种人：',
        a: [
            { text: '喜欢先看整个大局面', value: 'N' },
            { text: '喜欢先拿握细节', value: 'S' },
        ]
    },
    {
        q: '以下描述更符合我的是：',
        a: [
            { text: '与其活在现实中，不如活在想象里', value: 'N' },
            { text: '与其活在想象里，不如活在现实中', value: 'S' },
        ]
    },
    {
        q: '我倾向如此做决定：',
        a: [
            { text: '首先依我的心意，然依我的逻辑', value: 'F' },
            { text: '首先依我的逻辑，然后依我的心意', value: 'T' },
        ]
    },
    {
        q: '我倾向比较能够察觉到：',
        a: [
            { text: '当人们需要情感上的支持时', value: 'F' },
            { text: '当人们不合逻辑时', value: 'T' },
        ]
    },
    {
        q: '当和他人吵架时:',
        a: [
            { text: '我通常让自己的情绪深陷其中', value: 'F' },
            { text: '理智看待事实，朋友错了绝对不妥协', value: 'T' },
        ]
    },
    {
        q: '当与他人相处时，我倾向：',
        a: [
            { text: '感性地表达个人感受和观点', value: 'F' },
            { text: '理性地沟通重要的想法，客观地讨论和辩论事情', value: 'T' },
        ]
    },
    {
        q: '当我不同意他人的想法时：',
        a: [
            { text: '我尽可能地避免伤害对方的感受', value: 'F' },
            { text: '我通常毫无保留地说话，并且对我的朋友直言直语，因为对的就是对的', value: 'T' },
        ]
    },
    {
        q: '认识我的人倾向形容我为：',
        a: [
            { text: '热情和敏感', value: 'F' },
            { text: '逻辑和明确', value: 'T' },
        ]
    },
    {
        q: '我把大部分和别人的相遇视为：',
        a: [
            { text: '友善及重要的', value: 'F' },
            { text: '另有目的', value: 'T' },
        ]
    },
    {
        q: '开始一个重要项目前，我会：',
        a: [
            { text: '先规划时间，有计划地开展', value: 'J' },
            { text: '边做边计划', value: 'P' },
        ]
    },
    {
        q: '在第一次约会中，我：',
        a: [
            { text: '若我所约的人来迟了，我会很不高兴', value: 'J' },
            { text: '一点都不在乎，因为我自己已常常迟到', value: 'P' },
        ]
    },
    {
        q: '我偏好：',
        a: [
            { text: '有部署、有节奏的工作', value: 'J' },
            { text: '有灵活性、较为松散的工作', value: 'P' },
        ]
    },
    {
        q: '我选择的生活循环着：',
        a: [
            { text: '日程表和组织', value: 'J' },
            { text: '自然发生和弹性', value: 'P' },
        ]
    },
    {
        q: '哪一项较为常见：',
        a: [
            { text: '我准时出席而其它人迟到', value: 'J' },
            { text: '其它人都准则出席而我迟到', value: 'P' },
        ]
    },
    {
        q: '通常情况下我习惯：',
        a: [
            { text: '下定决心并且做出最后肯定的结论', value: 'J' },
            { text: '开放我的选择并且持续收集信息', value: 'P' },
        ]
    },
    {
        q: '我是这类型的人：',
        a: [
            { text: '喜欢在一个时间里专心于一件事情直到完成', value: 'J' },
            { text: '享受同时进行好几件事情', value: 'P' },
        ]
    },
    {
        q: '当你要外出一整天，你会',
        a: [
            { text: '计划你要做什么和在什么时候做', value: 'J' },
            { text: '说去就去', value: 'P' },
        ]
    },
    {
        q: '你认为自己是一个',
        a: [
            { text: '较为随兴所至的人', value: 'P' },
            { text: '较为有条理的人', value: 'J' },
        ]
    },
    {
        q: '假如你是一位老师，你会选教',
        a: [
            { text: '以事实为主的课程', value: 'S' },
            { text: '涉及理论的课程', value: 'N' },
        ]
    },
    {
        q: '你通常',
        a: [
            { text: '与人容易混熟', value: 'E' },
            { text: '比较沉静或矜持', value: 'I' },
        ]
    },
    {
        q: '一般来说，你和哪些人比较合得来',
        a: [
            { text: '富于想象力的人', value: 'N' },
            { text: '现实的人', value: 'S' },
        ]
    },
    {
        q: '你是否经常让',
        a: [
            { text: '你的情感支配你的理智', value: 'F' },
            { text: '你的理智主宰你的情感', value: 'T' },
        ]
    },
    {
        q: '处理许多事情上，你会喜欢',
        a: [
            { text: '凭兴所至行事', value: 'P' },
            { text: '按照计划行事', value: 'J' },
        ]
    },
    {
        q: '你是否',
        a: [
            { text: '容易让人了解', value: 'E' },
            { text: '难于让人了解', value: 'I' },
        ]
    },
    {
        q: '按照工作计划做事',
        a: [
            { text: '合你心意', value: 'J' },
            { text: '令你感到束缚', value: 'P' },
        ]
    },
    {
        q: '当你有一份特别的任务，你会喜欢',
        a: [
            { text: '开始前小心组织计划', value: 'J' },
            { text: '边做边找须做什么', value: 'P' },
        ]
    },
    {
        q: '在大多数情况下，你会选择',
        a: [
            { text: '顺其自然', value: 'P' },
            { text: '按工作计划做事', value: 'J' },
        ]
    },
    {
        q: '大多数人会说你是一个',
        a: [
            { text: '重视自我隐私的人', value: 'I' },
            { text: '非常坦率开放的人', value: 'E' },
        ]
    }, {
        q: '你更愿意被人认为是一个',
        a: [
            { text: '实事求是的人', value: 'S' },
            { text: '机灵的人', value: 'N' },
        ]
    },
    {
        q: '在一大群人当中，通常是',
        a: [
            { text: '你介绍大家认识', value: 'E' },
            { text: '别人介绍你', value: 'I' },
        ]
    },
    {
        q: '你会跟哪些人做朋友',
        a: [
            { text: '常提出新主意的', value: 'N' },
            { text: '脚踏实地的', value: 'S' },
        ]
    },
    {
        q: '你倾向',
        a: [
            { text: '重视感情多于逻辑', value: 'F' },
            { text: '重视逻辑多于感情', value: 'T' },
        ]
    },
    {
        q: '你比较喜欢',
        a: [
            { text: '坐观事情发展才作计划', value: 'P' },
            { text: '很早就作计划', value: 'J' },
        ]
    },
    {
        q: '你喜欢花很多的时间',
        a: [
            { text: '一个人独处', value: 'I' },
            { text: '和别人在一起', value: 'E' },
        ]
    }, {
        q: '你比较喜欢',
        a: [
            { text: '很早便把约会、社交聚集等事情安排妥当', value: 'J' },
            { text: '无拘无束，看当时有什么好玩就做什么', value: 'P' },
        ]
    },
    {
        q: '计划一个旅程时，你较喜欢',
        a: [
            { text: '大部分的时间都是跟当天的感觉行事', value: 'P' },
            { text: '事先知道大部分的日子会做什么', value: 'J' },
        ]
    },
    {
        q: '在社交聚会中，你',
        a: [
            { text: '有时感到郁闷', value: 'I' },
            { text: '常常乐在其中', value: 'E' },
        ]
    }, {
        q: '你通常',
        a: [
            { text: '和别人容易混熟', value: 'E' },
            { text: '趋向自处一隅', value: 'I' },
        ]
    },
    {
        q: '哪些人会更吸引你',
        a: [
            { text: '一个思想敏捷及非常聪颖的人', value: 'T' },
            { text: '实事求是，具丰富常识的人', value: 'F' },
        ]
    },
    {
        q: '在日常工作中，你会',
        a: [
            { text: '颇为喜欢处理迫使你分秒必争的突发', value: 'P' },
            { text: '通常预先计划，以免要在压力下工作', value: 'J' },
        ]
    },
    {
        q: '你认为别人一般',
        a: [
            { text: '要花很长时间才认识你', value: 'I' },
            { text: '用很短的时间便认识你', value: 'E' },
        ]
    }, {
        q: '当你要在一个星期内完成一个大项目，你在开始的时候会',
        a: [
            { text: '把要做的不同工作依次列出', value: 'J' },
            { text: '马上动工', value: 'P' },
        ]
    },
    {
        q: '在社交场合中，你经常会感到',
        a: [
            { text: '与某些人很难打开话匣儿和保持对话', value: 'I' },
            { text: '与多数人都能从容地长谈', value: 'E' },
        ]
    }, {
        q: '要做许多人也做的事，你比较喜欢',
        a: [
            { text: '按照一般认可的方法去做', value: 'S' },
            { text: '构想一个自己的想法', value: 'N' },
        ]
    },
    {
        q: '你刚认识的朋友能否说出你的兴趣',
        a: [
            { text: '马上可以', value: 'E' },
            { text: '要待他们真正了解你之后才可以', value: 'I' },
        ]
    },
    {
        q: '关于培训，你通常较喜欢',
        a: [
            { text: '讲授概念和原则的', value: 'N' },
            { text: '讲授事实和数据的', value: 'S' },
        ]
    },
    {
        q: '哪个是较高的赞誉，或称许为',
        a: [
            { text: '一贯感性的人', value: 'F' },
            { text: '一贯理性的人', value: 'T' },
        ]
    },
    {
        q: '你认为按照工作计划做事',
        a: [
            { text: '有时是需要的，但一般来说你不大喜欢这样做', value: 'P' },
            { text: '大多数情况下是有帮助而且是你喜欢做的', value: 'J' },
        ]
    },
    {
        q: '和一群人在一起，你通常会选',
        a: [
            { text: '跟你很熟悉的个别人谈话', value: 'I' },
            { text: '参与大伙的谈话', value: 'E' },
        ]
    }, {
        q: '在社交聚会上，你会',
        a: [
            { text: '是说话很多的一个', value: 'E' },
            { text: '让别人多说话', value: 'I' },
        ]
    },
    {
        q: '把周末期间要完成的事列成清单，这个主意会',
        a: [
            { text: '合你意', value: 'J' },
            { text: '使你提不起劲', value: 'P' },
        ]
    },
    {
        q: '哪个是较高的赞誉',
        a: [
            { text: '能干的', value: 'T' },
            { text: '富有同情心', value: 'F' },
        ]
    },
    {
        q: '你通常喜欢',
        a: [
            { text: '事先安排你的社交约会', value: 'J' },
            { text: '随兴之所至做事', value: 'P' },
        ]
    },
    {
        q: '总的说来，要做一个大型项目时，你会选',
        a: [
            { text: '边做边想该做什么', value: 'P' },
            { text: '首先把工作按步细分', value: 'J' },
        ]
    },
    {
        q: '你能否滔滔不绝地与人聊天',
        a: [
            { text: '只限于跟你有共同兴趣的人', value: 'I' },
            { text: '几乎跟任何人都可以', value: 'E' },
        ]
    }, {
        q: '你会',
        a: [
            { text: '跟随一些证明有效的方法', value: 'S' },
            { text: '分析还有什么毛病，及针对尚未解决的难题', value: 'N' },
        ]
    },
    {
        q: '为乐趣而阅读时，你会',
        a: [
            { text: '喜欢奇特或创新的表达方式', value: 'N' },
            { text: '喜欢作者直话直说', value: 'S' },
        ]
    },
    {
        q: '你更倾向与哪一类上司工作',
        a: [
            { text: '天性淳良，但常常前后不一的', value: 'T' },
            { text: '言词尖锐但永远合乎逻辑的', value: 'N' },
        ]
    },
    {
        q: '你做事多数是',
        a: [
            { text: '按当天心情去做', value: 'P' },
            { text: '按拟好的工作计划去做', value: 'J' },
        ]
    },
    {
        q: '你是否',
        a: [
            { text: '可以和任何人按需求从容地交谈', value: 'E' },
            { text: '只是对某些人或在某种情况下才可以畅所欲言', value: 'I' },
        ]
    },
    {
        q: '要作决定时，你认为比较重要的是',
        a: [
            { text: '据事实衡量', value: 'T' },
            { text: '考虑他人的感受和意见', value: 'F' },
        ]
    }
]

export const infoList = [
  {
    name: 'ISTJ',
    desc: '严肃、安静、藉由集中心志与全力投入、及可被信赖获致成功。行事务实、有序、实际、逻辑、真实及可信赖十分留意且乐于任何事（工作、居家、生活均有良好组织及有序。负责任。照设定成效来作出决策且不畏阻挠与闲言会坚定为之。重视传统与忠诚。传统性的思考者或经理。'
  },
  {
    name: 'ISFJ',
    desc: '安静、和善、负责任且有良心。行事尽责投入。安定性高，常居项目工作或团体之安定力量。愿投入、吃苦及力求精确。兴趣通常不在于科技方面。对细节事务有耐心。忠诚、考虑周到、知性且会关切他人感受。致力于创构有序及和谐的工作与家庭环境。'
  },
  {
    name: 'INFJ',
    desc: '因为坚忍、创意及必须达成的意图而能成功。会在工作中投注最大的努力。默默强力的、诚挚的及用心的关切他人。因坚守原则而受敬重。提出造福大众利益的明确远景而为人所尊敬与追随。追求创见、关系及物质财物的意义及关联。想了解什么能激励别人及对他人具洞察力。光明正大且坚信其价值观。有组织且果断地履行其愿景。'
  },
  {
    name: 'INTJ',
    desc: '具强大动力与本意来达成目的与创意—固执顽固者。有宏大的愿景且能快速在众多外界事件中找出有意义的模范。对所承负职务，具良好能力于策划工作并完成。具怀疑心、挑剔性、独立性、果决，对专业水准及绩效要求高。'
  },
  {
    name: 'ISTP',
    desc: '冷静旁观者—安静、预留余地、弹性及会以无偏见的好奇心与未预期原始的幽默观察与分析。有兴趣于探索原因及效果，技术事件是为何及如何运作且使用逻辑的原理组构事实、重视效能。擅长于掌握问题核心及找出解决方式。分析成事的缘由且能实时由大量资料中找出实际问题的核心。'
  },
  {
    name: 'ISFP',
    desc: '羞怯的、安宁和善地、敏感的、亲切的、且行事谦虚。喜于避开争论，不对他人强加已见或价值观。无意于领导却常是忠诚的追随者。办事不急躁，安于现状无意于以过度的急切或努力破坏现况，且非成果导向。喜欢有自有的空间及照自订的时程办事。'
  },
  {
    name: 'INFP',
    desc: '安静观察者，具理想性与对其价值观及重要之人具忠诚心。希外在生活形态与内在价值观相吻合。具好奇心且很快能看出机会所在。常担负开发创意的触媒者。除非价值观受侵犯，行事会具弹性、适应力高且承受力强。具想了解及发展他人潜能的企图。想作太多且作事全神贯注。对所处境遇及拥有不太在意。具适应力、有弹性除非价值观受到威胁。'
  },
  {
    name: 'INTP',
    desc: '安静、自持、弹性及具适应力。特别喜爱追求理论与科学事理。习于以逻辑及分析来解决问题—问题解决者。最有兴趣于创意事务及特定工作，对聚会与闲聊无大兴趣。追求可发挥个人强烈兴趣的生涯。追求发展对有兴趣事务之逻辑解释。'
  },
  {
    name: 'ESTP',
    desc: '擅长现场实时解决问题—解决问题者。喜欢办事并乐于其中及过程。倾向于喜好技术事务及运动，交结同好友人。具适应性、容忍度、务实性；投注心力于会很快具成效工作。不喜欢冗长概念的解释及理论。最专精于可操作、处理、分解或组合的真实事务。'
  },
  {
    name: 'ESFP',
    desc: '外向、和善、接受性、乐于分享喜乐予他人。喜欢与他人一起行动且促成事件发生，在学习时亦然。知晓事件未来的发展并会热列参与。最擅长于人际相处能力及具备完备常识，很有弹性能立即适应他人与环境。对生命、人、物质享受的热爱者。'
  },
  {
    name: 'ENFP',
    desc: '充满热忱、活力充沛、聪明的、富想象力的，视生命充满机会但期能得自他人肯定与支持。几乎能达成所有有兴趣的事。对难题很快就有对策并能对有困难的人施予援手。依赖能改善的能力而无须预作规划准备。为达目的常能找出强制自己为之的理由。即兴执行者。 '
  },
  {
    name: 'ENTP',
    desc: '反应快、聪明、长于多样事务。具激励伙伴、敏捷及直言讳专长。会为了有趣对问题的两面加予争辩。对解决新及挑战性的问题富有策略，但会轻忽或厌烦经常的任务与细节。兴趣多元，易倾向于转移至新生的兴趣。对所想要的会有技巧地找出逻辑的理由。长于看清础他人，有智能去解决新或有挑战的问题。'
  },
  {
    name: 'ESTJ',
    desc: '务实、真实、事实倾向，具企业或技术天份。不喜欢抽象理论；最喜欢学习可立即运用事理。喜好组织与管理活动且专注以最有效率方式行事以达致成效。具决断力、关注细节且很快作出决策—优秀行政者。会忽略他人感受。喜作领导者或企业主管。'
  },
  {
    name: 'ESFJ',
    desc: '诚挚、爱说话、合作性高、受欢迎、光明正大的—天生的合作者及活跃的组织成员。重和谐且长于创造和谐。常作对他人有益事务。给予鼓励及称许会有更佳工作成效。最有兴趣于会直接及有形影响人们生活的事务。喜欢与他人共事去精确且准时地完成工作。'
  },
  {
    name: 'ENFJ',
    desc: '热忱、易感应及负责任的--具能鼓励他人的领导风格。对别人所想或希求会表达真正关切且切实用心去处理。能怡然且技巧性地带领团体讨论或演示文稿提案。爱交际、受欢迎及富同情心。对称许及批评很在意。喜欢带引别人且能使别人或团体发挥潜能。'
  },
  {
    name: 'ENTJ',
    desc: '坦诚、具决策力的活动领导者。长于发展与实施广泛的系统以解决组织的问题。专精于具内涵与智能的谈话如对公众演讲。乐于经常吸收新知且能广开信息管道。易生过度自信，会强于表达自已创见。喜于长程策划及目标设定。'
  },
]
